linux内核设计与实现.org
#+SETUPFILE: ~/.emacs.d/themes/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: \n:t
#+OPTIONS: ^:nil
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+attr_html: :width 300px
#+attr_latex: :width 300px
#+ATTR_ORG: :width 300

#+TITLE: 程序员的自我修养 - 基于x86 linux2.6


* 第一章 linux内核简介

内核是一个不可分割的静态可执行文件

- 单内核 - 单独的大过程，功能实现基本是函数调用，linux
- 微内核 - 分割为多个独立的过程，少数运行在特权模式，过程间用IPC通信，但实际应用中由于开销比较大，向单内核靠拢

linux版本 主版本号.从版本号.修订版本号.稳定版本号，其中 *从版本号偶数为稳定版*

上下文:
- 运行于用户态，执行用户进程
- 运行于内核空间，处于进程上下文，代表某个特定的进程执行 (int 0x80)
- 运行于内核空间，处于中断上下文，与任何进程无关，处理特定中断， *实际是用了被中断进程的内核栈*

* 第二章 从内核出发

*git://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux-2.6.git*
e40152ee1e1c7a63f4777791863215e3faa37a86

iso: http://mirrors.ustc.edu.cn/ubuntu-old-releases/releases/10.04.0/ubuntu-10.04-desktop-i386.iso

#+begin_src txt
###### Ubuntu Main Repos
######

deb http://old-releases.ubuntu.com/ubuntu/ lucid main restricted
deb-src http://old-releases.ubuntu.com/ubuntu/ lucid main restricted
#+end_src

由于linux-2.6内核相对于现在来说很老了，最新的gcc glibc编译老的2.6内核会有各种问题，所以用老的基于linux2.6的系统最为方便

- 软件包推荐
| Name           | Description         |
|----------------+---------------------|
| openssh-server | ssh server          |
| vion           | VNC server，自带    |
| ncurses-dev    | make menuconfig所需 |

- 内核配置
| make config       | 遍历所有配置项 |
| *make menuconfig* | 图形界面工具   |
| make defconfig    | 缺省配置       |
| make oldconfig    | 验证和更新配置 |

- 拷贝本系统配置
#+begin_src bash
  zcat /proc/config.gz > .config  # 如果系统已开启CONFIG_IKCONFIG_PROC
  make oldconfig
#+end_src

- 内核编译
.config配置好以后, 执行make

- 内核安装
1. 生成的arch/i386/boot/bzImage拷到/boot下
2. make modules_install

内核开发的特点
- 无libc库或无标准头文件
- 经常使用编译器扩展特性
内联函数
内联汇编
链接脚本
关于时间戳，是64位的，但是经常也用到高32位，为了防止每次都额外做一次位运算，定义两个符号，指向同一个地址，一个是32位的，一个是64位
likely和unlikely
- 无内存保护
- 浮点
以前的cpu做浮点运算都有个协处理器，这样会使CPU陷入，所以尽量不要用浮点
- 内核栈大小有限，32位机默认是8KB
- *同步和并发* 开了内核抢占和非抢占时锁的行为和中断发生的时为不一样，要特别注意
- 可移植性，尽量做到体系无关

