linux内核设计与实现.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-12 Mon 12:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>程序员的自我修养 - 基于x86 linux2.6</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xuali2" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">程序员的自我修养 - 基于x86 linux2.6</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcff6427">1. 第一章 linux内核简介</a></li>
<li><a href="#org42f836b">2. 第二章 从内核出发</a></li>
<li><a href="#org996d3f6">3. 第三章 进程管理</a></li>
<li><a href="#org978de23">4. 第四章 进程调度</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgcff6427" class="outline-2">
<h2 id="orgcff6427"><span class="section-number-2">1</span> 第一章 linux内核简介</h2>
<div class="outline-text-2" id="text-1">
<p>
内核是一个不可分割的静态可执行文件<br />
</p>

<ul class="org-ul">
<li>单内核 - 单独的大过程，功能实现基本是函数调用，linux<br /></li>
<li>微内核 - 分割为多个独立的过程，少数运行在特权模式，过程间用IPC通信，但实际应用中由于开销比较大，向单内核靠拢<br /></li>
</ul>

<p>
linux版本 主版本号.从版本号.修订版本号.稳定版本号，其中 <b>从版本号偶数为稳定版</b><br />
</p>

<p>
上下文:<br />
</p>
<ul class="org-ul">
<li>运行于用户态，执行用户进程<br /></li>
<li>运行于内核空间，处于进程上下文，代表某个特定的进程执行 (int 0x80)<br /></li>
<li>运行于内核空间，处于中断上下文，与任何进程无关，处理特定中断， <b>实际是用了被中断进程的内核栈</b><br /></li>
</ul>
</div>
</div>

<div id="outline-container-org42f836b" class="outline-2">
<h2 id="org42f836b"><span class="section-number-2">2</span> 第二章 从内核出发</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>git://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux-2.6.git</b><br />
e40152ee1e1c7a63f4777791863215e3faa37a86<br />
</p>

<p>
iso: <a href="http://mirrors.ustc.edu.cn/ubuntu-old-releases/releases/10.04.0/ubuntu-10.04-desktop-i386.iso">http://mirrors.ustc.edu.cn/ubuntu-old-releases/releases/10.04.0/ubuntu-10.04-desktop-i386.iso</a><br />
</p>

<div class="org-src-container">
<pre class="src src-txt">###### Ubuntu Main Repos
######

deb http://old-releases.ubuntu.com/ubuntu/ lucid main restricted
deb-src http://old-releases.ubuntu.com/ubuntu/ lucid main restricted
</pre>
</div>

<p>
由于linux-2.6内核相对于现在来说很老了，最新的gcc glibc编译老的2.6内核会有各种问题，所以用老的基于linux2.6的系统最为方便<br />
</p>

<ul class="org-ul">
<li>软件包推荐<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">openssh-server</td>
<td class="org-left">ssh server</td>
</tr>

<tr>
<td class="org-left">vion</td>
<td class="org-left">VNC server，自带</td>
</tr>

<tr>
<td class="org-left">ncurses-dev</td>
<td class="org-left">make menuconfig所需</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>内核配置<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">make config</td>
<td class="org-left">遍历所有配置项</td>
</tr>

<tr>
<td class="org-left"><b>make menuconfig</b></td>
<td class="org-left">图形界面工具</td>
</tr>

<tr>
<td class="org-left">make defconfig</td>
<td class="org-left">缺省配置</td>
</tr>

<tr>
<td class="org-left">make oldconfig</td>
<td class="org-left">验证和更新配置</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>拷贝本系统配置<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">zcat /proc/config.gz &gt; .config  <span style="color: #75715E;"># </span><span style="color: #E6DB74;">&#22914;&#26524;&#31995;&#32479;&#24050;&#24320;&#21551;CONFIG_IKCONFIG_PROC</span>
make oldconfig
</pre>
</div>

<ul class="org-ul">
<li>内核编译<br /></li>
</ul>
<p>
.config配置好以后, 执行make<br />
</p>

<ul class="org-ul">
<li>内核安装<br /></li>
<li>生成的arch/i386/boot/bzImage拷到/boot下<br /></li>
<li>make modules_install<br /></li>
</ul>

<p>
内核开发的特点<br />
</p>
<ul class="org-ul">
<li>无libc库或无标准头文件<br /></li>
<li>经常使用编译器扩展特性<br /></li>
</ul>
<p>
内联函数<br />
内联汇编<br />
链接脚本<br />
关于时间戳，是64位的，但是经常也用到高32位，为了防止每次都额外做一次位运算，定义两个符号，指向同一个地址，一个是32位的，一个是64位<br />
likely和unlikely<br />
</p>
<ul class="org-ul">
<li>无内存保护<br /></li>
<li>浮点<br /></li>
</ul>
<p>
以前的cpu做浮点运算都有个协处理器，这样会使CPU陷入，所以尽量不要用浮点<br />
</p>
<ul class="org-ul">
<li>内核栈大小有限，32位机默认是8KB<br /></li>
<li><b>同步和并发</b> 开了内核抢占和非抢占时锁的行为和中断发生的时为不一样，要特别注意<br /></li>
<li>可移植性，尽量做到体系无关<br /></li>
</ul>
</div>
</div>
