linux内核设计与实现.html

<div id="outline-container-org996d3f6" class="outline-2">
<h2 id="org996d3f6"><span class="section-number-2">3</span> 第三章 进程管理</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>进程列表存放在任务队列的双向循环链表中 - task list<br /></li>
<li>task_struct指针在thread_info中，thread_info在内核栈栈底，这样获取thread_info地址简单的方法就是esp &amp; (0xFFFFFFFF &lt;&lt; 13)，task_struct就是(esp &amp; (0xFFFFFFFF &lt;&lt; 13))-&gt;task<br /></li>
</ul>

<p>
<b>像POWERPC, task_struct指针直接存在r2，相对的说原因之一就是x86的寄存器不够用</b><br />
</p>

<ul class="org-ul">
<li>默认最大PID是32768<br /></li>
<li>进程状态<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">TASK_RUNNINNG</td>
<td class="org-left">运行</td>
</tr>

<tr>
<td class="org-left">TASK_INNTERRUPTIBLE</td>
<td class="org-left">可中断，正在睡眠</td>
</tr>

<tr>
<td class="org-left">TASK_UNINTERRUPTIBLE</td>
<td class="org-left">类似可中断，但对信号不做响应</td>
</tr>

<tr>
<td class="org-left">__TASK_TRACED</td>
<td class="org-left">被其他进程跟踪</td>
</tr>

<tr>
<td class="org-left">__TASK_STOPPED</td>
<td class="org-left">进程停止执行</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>task-&gt;state是进程状态<br /></li>
<li>所有进程都是PID为1的init进程的后代， <b>而init进程的相关数据是静态写在kernel代码里的</b>, parent是父进程，childern是子进程链表，sibling是兄弟进程链表，同时所有进程在双向链表tasks中<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">volatile</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">state</span>;    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">-1 unrunnable, 0 runnable, &gt;0 stopped </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">stack</span>;
    <span style="color: #66D9EF;">atomic_t</span> <span style="color: #FD971F;">usage</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">flags</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">per process flags, defined below </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">ptrace</span>;

    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">lock_depth</span>;     <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">BKL lock depth </span><span style="color: #75715E;">*/</span>

<span style="color: #F92672;">#ifdef</span> CONFIG_SMP
<span style="color: #F92672;">#ifdef</span> __ARCH_WANT_UNLOCKED_CTXSW
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">oncpu</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#endif</span>

    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">prio</span>, <span style="color: #FD971F;">static_prio</span>, <span style="color: #FD971F;">normal_prio</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">rt_priority</span>;
    <span style="color: #F92672;">const</span> <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_class</span> *<span style="color: #FD971F;">sched_class</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span> <span style="color: #FD971F;">se</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_rt_entity</span> <span style="color: #FD971F;">rt</span>;

<span style="color: #F92672;">#ifdef</span> CONFIG_PREEMPT_NOTIFIERS
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">list of struct preempt_notifier: </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">hlist_head</span> <span style="color: #FD971F;">preempt_notifiers</span>;
<span style="color: #F92672;">#endif</span>

    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * fpu_counter contains the number of consecutive context switches</span>
<span style="color: #E6DB74;">     * that the FPU is used. If this is over a threshold, the lazy fpu</span>
<span style="color: #E6DB74;">     * saving becomes unlazy to save the trap. This is an unsigned char</span>
<span style="color: #E6DB74;">     * so that after 256 times the counter wraps and the behavior turns</span>
<span style="color: #E6DB74;">     * lazy again; this to deal with bursty apps that only use FPU for</span>
<span style="color: #E6DB74;">     * a short time</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">fpu_counter</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_BLK_DEV_IO_TRACE
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">btrace_seq</span>;
<span style="color: #F92672;">#endif</span>

    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">policy</span>;
    <span style="color: #66D9EF;">cpumask_t</span> <span style="color: #FD971F;">cpus_allowed</span>;

<span style="color: #F92672;">#ifdef</span> CONFIG_TREE_PREEMPT_RCU
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">rcu_read_lock_nesting</span>;
    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">rcu_read_unlock_special</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">rcu_node</span> *<span style="color: #FD971F;">rcu_blocked_node</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">rcu_node_entry</span>;
<span style="color: #F92672;">#endif</span> <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">#ifdef CONFIG_TREE_PREEMPT_RCU </span><span style="color: #75715E;">*/</span>

<span style="color: #F92672;">#if</span> <span style="color: #F92672;">defined</span><span style="color: #66D9EF;">(</span>CONFIG_SCHEDSTATS<span style="color: #66D9EF;">)</span> || <span style="color: #F92672;">defined</span><span style="color: #66D9EF;">(</span>CONFIG_TASK_DELAY_ACCT<span style="color: #66D9EF;">)</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_info</span> <span style="color: #FD971F;">sched_info</span>;
<span style="color: #F92672;">#endif</span>

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">tasks</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">plist_node</span> <span style="color: #FD971F;">pushable_tasks</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mm_struct</span> *<span style="color: #FD971F;">mm</span>, *<span style="color: #FD971F;">active_mm</span>;
<span style="color: #F92672;">#if</span> <span style="color: #F92672;">defined</span><span style="color: #66D9EF;">(</span>SPLIT_RSS_COUNTING<span style="color: #66D9EF;">)</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_rss_stat</span>    <span style="color: #FD971F;">rss_stat</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">task state </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">exit_state</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">exit_code</span>, <span style="color: #FD971F;">exit_signal</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">pdeath_signal</span>;  <span style="color: #75715E;">/*  </span><span style="color: #E6DB74;">The signal sent when the parent dies  </span><span style="color: #75715E;">*/</span>
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">??? </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">personality</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #FD971F;">did_exec</span>:1;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #FD971F;">in_execve</span>:1;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Tell the LSMs that the process is doing an</span>
<span style="color: #E6DB74;">                 * execve </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #FD971F;">in_iowait</span>:1;


    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Revert to default priority/policy when forking </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #FD971F;">sched_reset_on_fork</span>:1;

    <span style="color: #66D9EF;">pid_t</span> <span style="color: #FD971F;">pid</span>;
    <span style="color: #66D9EF;">pid_t</span> <span style="color: #FD971F;">tgid</span>;

<span style="color: #F92672;">#ifdef</span> CONFIG_CC_STACKPROTECTOR
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Canary value for the -fstack-protector gcc feature </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">stack_canary</span>;
<span style="color: #F92672;">#endif</span>

    <span style="color: #75715E;">/* </span>
<span style="color: #E6DB74;">     * pointers to (original) parent process, youngest child, younger sibling,</span>
<span style="color: #E6DB74;">     * older sibling, respectively.  (p-&gt;father can be replaced with </span>
<span style="color: #E6DB74;">     * p-&gt;real_parent-&gt;pid)</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span> *<span style="color: #FD971F;">real_parent</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">real parent process </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span> *<span style="color: #FD971F;">parent</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">recipient of SIGCHLD, wait4() reports </span><span style="color: #75715E;">*/</span>
    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * children/sibling forms the list of my natural children</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">children</span>;  <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">list of my children </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">sibling</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">linkage in my parent's children list </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span> *<span style="color: #FD971F;">group_leader</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">threadgroup leader </span><span style="color: #75715E;">*/</span>

    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * ptraced is the list of tasks this task is using ptrace on.</span>
<span style="color: #E6DB74;">     * This includes both natural children and PTRACE_ATTACH targets.</span>
<span style="color: #E6DB74;">     * p-&gt;ptrace_entry is p's link on the p-&gt;parent-&gt;ptraced list.</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">ptraced</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">ptrace_entry</span>;

    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * This is the tracer handle for the ptrace BTS extension.</span>
<span style="color: #E6DB74;">     * This field actually belongs to the ptracer task.</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">bts_context</span> *<span style="color: #FD971F;">bts</span>;

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">PID/PID hash table linkage. </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">pid_link</span> <span style="color: #FD971F;">pids</span><span style="color: #66D9EF;">[</span>PIDTYPE_MAX<span style="color: #66D9EF;">]</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">thread_group</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">completion</span> *<span style="color: #FD971F;">vfork_done</span>;      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">for vfork() </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">__user</span> *set_child_tid;      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">CLONE_CHILD_SETTID </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">__user</span> *clear_child_tid;        <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">CLONE_CHILD_CLEARTID </span><span style="color: #75715E;">*/</span>

    <span style="color: #66D9EF;">cputime_t</span> <span style="color: #FD971F;">utime</span>, <span style="color: #FD971F;">stime</span>, <span style="color: #FD971F;">utimescaled</span>, <span style="color: #FD971F;">stimescaled</span>;
    <span style="color: #66D9EF;">cputime_t</span> <span style="color: #FD971F;">gtime</span>;
<span style="color: #F92672;">#if</span><span style="color: #F92672; font-weight: bold;">n</span><span style="color: #F92672;">def</span> CONFIG_VIRT_CPU_ACCOUNTING
    <span style="color: #66D9EF;">cputime_t</span> <span style="color: #FD971F;">prev_utime</span>, <span style="color: #FD971F;">prev_stime</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">nvcsw</span>, <span style="color: #FD971F;">nivcsw</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">context switch counts </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">timespec</span> <span style="color: #FD971F;">start_time</span>;         <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">monotonic time </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">timespec</span> <span style="color: #FD971F;">real_start_time</span>;    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">boot based time </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">mm fault and swap info: this can arguably be seen as either mm-specific or thread-specific </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">min_flt</span>, <span style="color: #FD971F;">maj_flt</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_cputime</span> <span style="color: #FD971F;">cputime_expires</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">cpu_timers</span><span style="color: #66D9EF;">[</span>3<span style="color: #66D9EF;">]</span>;

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">process credentials </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">const</span> <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cred</span> *<span style="color: #FD971F;">real_cred</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">objective and real subjective task</span>
<span style="color: #E6DB74;">                     * credentials (COW) </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">const</span> <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cred</span> *<span style="color: #FD971F;">cred</span>;    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">effective (overridable) subjective task</span>
<span style="color: #E6DB74;">                     * credentials (COW) </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mutex</span> <span style="color: #FD971F;">cred_guard_mutex</span>;  <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">guard against foreign influences on</span>
<span style="color: #E6DB74;">                     * credential calculations</span>
<span style="color: #E6DB74;">                     * (notably. ptrace) </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cred</span> *<span style="color: #FD971F;">replacement_session_keyring</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">for KEYCTL_SESSION_TO_PARENT </span><span style="color: #75715E;">*/</span>

    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">comm</span><span style="color: #66D9EF;">[</span>TASK_COMM_LEN<span style="color: #66D9EF;">]</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">executable name excluding path</span>
<span style="color: #E6DB74;">                     - access with [gs]et_task_comm (which lock</span>
<span style="color: #E6DB74;">                       it with task_lock())</span>
<span style="color: #E6DB74;">                     - initialized normally by setup_new_exec </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">file system info </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">link_count</span>, <span style="color: #FD971F;">total_link_count</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_SYSVIPC
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">ipc stuff </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sysv_sem</span> <span style="color: #FD971F;">sysvsem</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_DETECT_HUNG_TASK
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">hung task detection </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">last_switch_count</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">CPU-specific state of this task </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">thread_struct</span> <span style="color: #FD971F;">thread</span>;
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">filesystem information </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">fs_struct</span> *<span style="color: #FD971F;">fs</span>;
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">open file information </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">files_struct</span> *<span style="color: #FD971F;">files</span>;
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">namespaces </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">nsproxy</span> *<span style="color: #FD971F;">nsproxy</span>;
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">signal handlers </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">signal_struct</span> *<span style="color: #FD971F;">signal</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sighand_struct</span> *<span style="color: #FD971F;">sighand</span>;

    <span style="color: #66D9EF;">sigset_t</span> <span style="color: #FD971F;">blocked</span>, <span style="color: #FD971F;">real_blocked</span>;
    <span style="color: #66D9EF;">sigset_t</span> <span style="color: #FD971F;">saved_sigmask</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">restored if set_restore_sigmask() was used </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sigpending</span> <span style="color: #FD971F;">pending</span>;

    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">sas_ss_sp</span>;
    <span style="color: #66D9EF;">size_t</span> <span style="color: #FD971F;">sas_ss_size</span>;
    <span style="color: #A6E22E; font-weight: bold;">int</span> <span style="color: #66D9EF;">(</span>*notifier<span style="color: #66D9EF;">)(</span><span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">priv</span><span style="color: #66D9EF;">)</span>;
    <span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">notifier_data</span>;
    <span style="color: #66D9EF;">sigset_t</span> *<span style="color: #FD971F;">notifier_mask</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">audit_context</span> *<span style="color: #FD971F;">audit_context</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_AUDITSYSCALL
    <span style="color: #66D9EF;">uid_t</span> <span style="color: #FD971F;">loginuid</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">sessionid</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #66D9EF;">seccomp_t</span> <span style="color: #FD971F;">seccomp</span>;

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Thread group tracking </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">u32</span> <span style="color: #FD971F;">parent_exec_id</span>;
    <span style="color: #66D9EF;">u32</span> <span style="color: #FD971F;">self_exec_id</span>;
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Protection of (de-)allocation: mm, files, fs, tty, keyrings, mems_allowed,</span>
<span style="color: #E6DB74;"> * mempolicy </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">spinlock_t</span> <span style="color: #FD971F;">alloc_lock</span>;

<span style="color: #F92672;">#ifdef</span> CONFIG_GENERIC_HARDIRQS
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">IRQ handler threads </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">irqaction</span> *<span style="color: #FD971F;">irqaction</span>;
<span style="color: #F92672;">#endif</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Protection of the PI data structures: </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">raw_spinlock_t</span> <span style="color: #FD971F;">pi_lock</span>;

<span style="color: #F92672;">#ifdef</span> CONFIG_RT_MUTEXES
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">PI waiters blocked on a rt_mutex held by this task </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">plist_head</span> <span style="color: #FD971F;">pi_waiters</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Deadlock detection and priority inheritance handling </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">rt_mutex_waiter</span> *<span style="color: #FD971F;">pi_blocked_on</span>;
<span style="color: #F92672;">#endif</span>

<span style="color: #F92672;">#ifdef</span> CONFIG_DEBUG_MUTEXES
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">mutex deadlock detection </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mutex_waiter</span> *<span style="color: #FD971F;">blocked_on</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_TRACE_IRQFLAGS
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">irq_events</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">hardirq_enable_ip</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">hardirq_disable_ip</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">hardirq_enable_event</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">hardirq_disable_event</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">hardirqs_enabled</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">hardirq_context</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">softirq_disable_ip</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">softirq_enable_ip</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">softirq_disable_event</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">softirq_enable_event</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">softirqs_enabled</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">softirq_context</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_LOCKDEP
<span style="color: #F92672;"># define</span> <span style="color: #FD971F;">MAX_LOCK_DEPTH</span> 48UL
    <span style="color: #66D9EF;">u64</span> <span style="color: #FD971F;">curr_chain_key</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">lockdep_depth</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">lockdep_recursion</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">held_lock</span> <span style="color: #FD971F;">held_locks</span><span style="color: #66D9EF;">[</span>MAX_LOCK_DEPTH<span style="color: #66D9EF;">]</span>;
    <span style="color: #66D9EF;">gfp_t</span> <span style="color: #FD971F;">lockdep_reclaim_gfp</span>;
<span style="color: #F92672;">#endif</span>

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">journalling filesystem info </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">journal_info</span>;

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">stacked block device info </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">bio_list</span> *<span style="color: #FD971F;">bio_list</span>;

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">VM state </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">reclaim_state</span> *<span style="color: #FD971F;">reclaim_state</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">backing_dev_info</span> *<span style="color: #FD971F;">backing_dev_info</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">io_context</span> *<span style="color: #FD971F;">io_context</span>;

    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">ptrace_message</span>;
    <span style="color: #66D9EF;">siginfo_t</span> *<span style="color: #FD971F;">last_siginfo</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">For ptrace use.  </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_io_accounting</span> <span style="color: #FD971F;">ioac</span>;
<span style="color: #F92672;">#if</span> <span style="color: #F92672;">defined</span><span style="color: #66D9EF;">(</span>CONFIG_TASK_XACCT<span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">u64</span> <span style="color: #FD971F;">acct_rss_mem1</span>;  <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">accumulated rss usage </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">u64</span> <span style="color: #FD971F;">acct_vm_mem1</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">accumulated virtual memory usage </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">cputime_t</span> <span style="color: #FD971F;">acct_timexpd</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">stime + utime since last update </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_CPUSETS
    <span style="color: #66D9EF;">nodemask_t</span> <span style="color: #FD971F;">mems_allowed</span>;    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Protected by alloc_lock </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">cpuset_mem_spread_rotor</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_CGROUPS
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Control Group info protected by css_set_lock </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">css_set</span> *<span style="color: #FD971F;">cgroups</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">cg_list protected by css_set_lock and tsk-&gt;alloc_lock </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">cg_list</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_FUTEX
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">robust_list_head</span> <span style="color: #66D9EF;">__user</span> *<span style="color: #FD971F;">robust_list</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_COMPAT
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">compat_robust_list_head</span> <span style="color: #66D9EF;">__user</span> *<span style="color: #FD971F;">compat_robust_list</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">pi_state_list</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">futex_pi_state</span> *<span style="color: #FD971F;">pi_state_cache</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_PERF_EVENTS
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">perf_event_context</span> *<span style="color: #FD971F;">perf_event_ctxp</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mutex</span> <span style="color: #FD971F;">perf_event_mutex</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span> <span style="color: #FD971F;">perf_event_list</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_NUMA
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mempolicy</span> *<span style="color: #FD971F;">mempolicy</span>;    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Protected by alloc_lock </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">short</span> <span style="color: #FD971F;">il_next</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #66D9EF;">atomic_t</span> <span style="color: #FD971F;">fs_excl</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">holding fs exclusive resources </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">rcu_head</span> <span style="color: #FD971F;">rcu</span>;

    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * cache last used pipe for splice</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">pipe_inode_info</span> *<span style="color: #FD971F;">splice_pipe</span>;
<span style="color: #F92672;">#ifdef</span>  CONFIG_TASK_DELAY_ACCT
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_delay_info</span> *<span style="color: #FD971F;">delays</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_FAULT_INJECTION
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">make_it_fail</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">prop_local_single</span> <span style="color: #FD971F;">dirties</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_LATENCYTOP
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">latency_record_count</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">latency_record</span> <span style="color: #FD971F;">latency_record</span><span style="color: #66D9EF;">[</span>LT_SAVECOUNT<span style="color: #66D9EF;">]</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * time slack values; these are used to round up poll() and</span>
<span style="color: #E6DB74;">     * select() etc timeout values. These are in nanoseconds.</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">timer_slack_ns</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">default_timer_slack_ns</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span>    *<span style="color: #FD971F;">scm_work_list</span>;
<span style="color: #F92672;">#ifdef</span> CONFIG_FUNCTION_GRAPH_TRACER
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Index of current stored address in ret_stack </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">curr_ret_stack</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Stack of return addresses for return function tracing </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">ftrace_ret_stack</span> *<span style="color: #FD971F;">ret_stack</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">time stamp for last schedule </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">ftrace_timestamp</span>;
    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * Number of functions that haven't been traced</span>
<span style="color: #E6DB74;">     * because of depth overrun.</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">atomic_t</span> <span style="color: #FD971F;">trace_overrun</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Pause for the tracing </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">atomic_t</span> <span style="color: #FD971F;">tracing_graph_pause</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_TRACING
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">state flags for use by tracers </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">trace</span>;
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">bitmask of trace recursion </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">trace_recursion</span>;
<span style="color: #F92672;">#endif</span> <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">CONFIG_TRACING </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">#ifdef</span> CONFIG_CGROUP_MEM_RES_CTLR <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">memcg uses this to do batch job </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">memcg_batch_info</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">do_batch</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">incremented when batch uncharge started </span><span style="color: #75715E;">*/</span>
        <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">mem_cgroup</span> *<span style="color: #FD971F;">memcg</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">target memcg of uncharge </span><span style="color: #75715E;">*/</span>
        <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">bytes</span>;        <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">uncharged usage </span><span style="color: #75715E;">*/</span>
        <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">memsw_bytes</span>; <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">uncharged mem+swap usage </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">}</span> <span style="color: #FD971F;">memcg_batch</span>;
<span style="color: #F92672;">#endif</span>
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">thread_info</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span>  *<span style="color: #FD971F;">task</span>;      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">main task structure </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">exec_domain</span>  *<span style="color: #FD971F;">exec_domain</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">execution domain </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">__u32</span>           <span style="color: #FD971F;">flags</span>;      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">low level flags </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">__u32</span>           <span style="color: #FD971F;">status</span>;     <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">thread synchronous flags </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">__u32</span>           <span style="color: #FD971F;">cpu</span>;        <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">current CPU </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">int</span>         <span style="color: #FD971F;">preempt_count</span>;  <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">0 =&gt; preemptable,</span>
<span style="color: #E6DB74;">                           &lt;0 =&gt; BUG </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">mm_segment_t</span>        <span style="color: #FD971F;">addr_limit</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">restart_block</span>    <span style="color: #FD971F;">restart_block</span>;
    <span style="color: #66D9EF;">void</span> <span style="color: #FD971F;">__user</span>     *sysenter_return;
<span style="color: #F92672;">#ifdef</span> CONFIG_X86_32
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span>           <span style="color: #FD971F;">previous_esp</span>;   <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">ESP of the previous stack in</span>
<span style="color: #E6DB74;">                           case of nested (IRQ) stacks</span>
<span style="color: #E6DB74;">                        </span><span style="color: #75715E;">*/</span>
    <span style="color: #66D9EF;">__u8</span>            <span style="color: #FD971F;">supervisor_stack</span><span style="color: #66D9EF;">[</span>0<span style="color: #66D9EF;">]</span>;
<span style="color: #F92672;">#endif</span>
    <span style="color: #66D9EF;">int</span>         <span style="color: #FD971F;">uaccess_err</span>;
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
<ul class="org-ul">
<li>写时拷贝,页权限设为只读，真正要写的时候再拷贝新页<br /></li>

<li>用户态fork -&gt; 用户态clone -&gt; 内核态do_fork -&gt; copy_process:<br /></li>
</ul>
<p>
dup_task_struct<br />
检查进程资源限制<br />
子进程task_struct某些信息清0<br />
子进程state = UNINTERRUPTIBLE<br />
copy_flags<br />
alloc_pid申请子进程pid<br />
资源分配<br />
</p>
<ul class="org-ul">
<li>vfork为了那些马上exec的进程使用，不推荐<br /></li>
<li>linux进程与线程的区别只在与是否共享某些资源<br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">CLONE 参数标志</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CLONE_FILES</td>
<td class="org-left">共享打开的文件</td>
</tr>

<tr>
<td class="org-left">CLONE_FS</td>
<td class="org-left">共享文件系统信息</td>
</tr>

<tr>
<td class="org-left">CLONE_IDLETASK</td>
<td class="org-left">PID设为0(dedicated for init process)</td>
</tr>

<tr>
<td class="org-left">CLONE_NEWNS</td>
<td class="org-left">子进程有新的命令空间</td>
</tr>

<tr>
<td class="org-left">CLONE_PARENT</td>
<td class="org-left">子进程与父进程拥有同一个父进程</td>
</tr>

<tr>
<td class="org-left">CLONE_PTRACE</td>
<td class="org-left">调试子进程，gdb会用这个</td>
</tr>

<tr>
<td class="org-left">CLONE_SETTID</td>
<td class="org-left">将TID回写至用户空间</td>
</tr>

<tr>
<td class="org-left">CLONE_SETTLS</td>
<td class="org-left">为子进程创建新的TLS</td>
</tr>

<tr>
<td class="org-left">CLONE_SIGHAND</td>
<td class="org-left">共享信号处理函数及被阻断的信号</td>
</tr>

<tr>
<td class="org-left">CLONE_SYSVEM</td>
<td class="org-left">共享SytemV SEM_UNDO语义</td>
</tr>

<tr>
<td class="org-left">CLONE_THREAD</td>
<td class="org-left">相同的线程组</td>
</tr>

<tr>
<td class="org-left">CLONE_VFORK</td>
<td class="org-left">vfork()使用</td>
</tr>

<tr>
<td class="org-left">CLONE_UNTRACED</td>
<td class="org-left">防止被trace,主要是防止跟踪</td>
</tr>

<tr>
<td class="org-left">CLONE_STOP</td>
<td class="org-left">以TASK_STOPPED状态开始进程</td>
</tr>

<tr>
<td class="org-left">CLONE_CHILD_CLEARTID</td>
<td class="org-left">清除子进程的TID</td>
</tr>

<tr>
<td class="org-left">CLONE_CHILD_SETTID</td>
<td class="org-left">设置子进程的TID</td>
</tr>

<tr>
<td class="org-left">CLONE_PARENT_SETTID</td>
<td class="org-left">设置父进程的TID</td>
</tr>

<tr>
<td class="org-left">CLONE_VM</td>
<td class="org-left"><b>共享地址空间</b></td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>内核线程，没用用户空间的线程， mm为NULL, 相关头文件为kthread.h<br /></li>
<li>exit -&gt; do_exit，永不返回<br /></li>
</ul>
<p>
task_struct标志PF_EXITING<br />
del_timer_sync<br />
exit_sem, exit_mm, exit_files, exit_fs<br />
设置exit_code<br />
exit_notify让其父进程为其子进程重新设置父进程，同时设状态为ZOMBIE<br />
schedule，父进程通过wait帮其清理内核栈, thread_info，task_struct<br />
</p>
<ul class="org-ul">
<li>wait<br /></li>
</ul>
<p>
为退出进程的子进程找新的父进程<br />
为被退出进程trace的进程找新的父进程<br />
</p>
</div>
</div>
