linux内核设计与实现.org
* 第四章 进程调度

- preemption 内核调度程序决定进程挂起与运行
- yielding   进程本身主动挂起
- 进程调度在响应时间和吞吐量之间做平衡
- 传统的绝对时间片会引发的固定的切换频率问题，linux使用了公平调度
se 是调度器实体
vruntime 虚拟实时，系统定时器周期性调用update_curr()更新

#+begin_src c
struct sched_entity {
	struct load_weight	load;		/* for load-balancing */
	struct rb_node		run_node;
	struct list_head	group_node;
	unsigned int		on_rq;

	u64			exec_start;
	u64			sum_exec_runtime;
	u64			vruntime;
	u64			prev_sum_exec_runtime;

	u64			last_wakeup;
	u64			avg_overlap;

	u64			nr_migrations;

	u64			start_runtime;
	u64			avg_wakeup;
//...
};

static void update_curr(struct cfs_rq *cfs_rq)
{
	struct sched_entity *curr = cfs_rq->curr;
	u64 now = rq_of(cfs_rq)->clock;
	unsigned long delta_exec;

	if (unlikely(!curr))
		return;

	/*
	 * Get the amount of time the current task was running
	 * since the last time we changed load (this cannot
	 * overflow on 32 bits):
	 */
	delta_exec = (unsigned long)(now - curr->exec_start);
	if (!delta_exec)
		return;

	__update_curr(cfs_rq, curr, delta_exec);
	curr->exec_start = now;

	if (entity_is_task(curr)) {
		struct task_struct *curtask = task_of(curr);

		trace_sched_stat_runtime(curtask, delta_exec, curr->vruntime);
		cpuacct_charge(curtask, delta_exec);
		account_group_exec_runtime(curtask, delta_exec);
	}
}

static inline void
__update_curr(struct cfs_rq *cfs_rq, struct sched_entity *curr,
	      unsigned long delta_exec)
{
	unsigned long delta_exec_weighted;

	schedstat_set(curr->exec_max, max((u64)delta_exec, curr->exec_max));

	curr->sum_exec_runtime += delta_exec;
	schedstat_add(cfs_rq, exec_clock, delta_exec);
	delta_exec_weighted = calc_delta_fair(delta_exec, curr);

	curr->vruntime += delta_exec_weighted;
	update_min_vruntime(cfs_rq);
}

#+end_src

- 进程选择
红黑树
enqueue_entity +进程
dequeue_entity -进程
#+begin_src c
static struct sched_entity *__pick_next_entity(struct cfs_rq *cfs_rq)
{
	struct rb_node *left = cfs_rq->rb_leftmost;

	if (!left)
		return NULL;

	return rb_entry(left, struct sched_entity, run_node);
}


#+end_src

- 调度器函数 schedule->pick_next_task，会从高优先级到低优先级调度器类中找第一个进程
- 休眠
从可执行红黑树中移出，放入等待队列
#+begin_src c
DEFINE_WAIT(wait); //创建队列项
add_wait_queue(q, &wait); //加入等待队列
while(!condition) {
//条件不满足
    prepare_to_wait(&q, &wait, TASK_INTERRUPTIBLE); //设置进程状态，如果此时已退出等待队列，重新加入
    if(signal_pending(current)) //处理信号
    schedule();//调度
}
finish_wait(&q, &wait);//结束等待
#+end_src
- 唤醒
从等待队列移到红黑树
- 抢占和上下文切换
switch_mm 切换虚拟内存映射
switch_to 切换寄存器组
