linux内核设计与实现.html

<div id="outline-container-org978de23" class="outline-2">
<h2 id="org978de23"><span class="section-number-2">4</span> 第四章 进程调度</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>preemption 内核调度程序决定进程挂起与运行<br /></li>
<li>yielding   进程本身主动挂起<br /></li>
<li>进程调度在响应时间和吞吐量之间做平衡<br /></li>
<li>传统的绝对时间片会引发的固定的切换频率问题，linux使用了公平调度<br /></li>
</ul>
<p>
se 是调度器实体<br />
vruntime 虚拟实时，系统定时器周期性调用update_curr()更新<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">load_weight</span>  <span style="color: #FD971F;">load</span>;       <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">for load-balancing </span><span style="color: #75715E;">*/</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">rb_node</span>      <span style="color: #FD971F;">run_node</span>;
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">list_head</span>    <span style="color: #FD971F;">group_node</span>;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">int</span>        <span style="color: #FD971F;">on_rq</span>;

    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">exec_start</span>;
    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">sum_exec_runtime</span>;
    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">vruntime</span>;
    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">prev_sum_exec_runtime</span>;

    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">last_wakeup</span>;
    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">avg_overlap</span>;

    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">nr_migrations</span>;

    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">start_runtime</span>;
    <span style="color: #66D9EF;">u64</span>         <span style="color: #FD971F;">avg_wakeup</span>;
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">...</span>
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">update_curr</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cfs_rq</span> *<span style="color: #FD971F;">cfs_rq</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span> *<span style="color: #FD971F;">curr</span> = cfs_rq-&gt;curr;
    <span style="color: #66D9EF;">u64</span> <span style="color: #FD971F;">now</span> = <span style="color: #A6E22E; font-weight: bold;">rq_of</span><span style="color: #66D9EF;">(</span>cfs_rq<span style="color: #66D9EF;">)</span>-&gt;clock;
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">delta_exec</span>;

    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E; font-weight: bold;">unlikely</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74; font-weight: bold;">!</span>curr<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
        <span style="color: #F92672;">return</span>;

    <span style="color: #75715E;">/*</span>
<span style="color: #E6DB74;">     * Get the amount of time the current task was running</span>
<span style="color: #E6DB74;">     * since the last time we changed load (this cannot</span>
<span style="color: #E6DB74;">     * overflow on 32 bits):</span>
<span style="color: #E6DB74;">     </span><span style="color: #75715E;">*/</span>
    delta_exec = <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span><span style="color: #66D9EF;">)(</span>now - curr-&gt;exec_start<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #E6DB74; font-weight: bold;">!</span>delta_exec<span style="color: #66D9EF;">)</span>
        <span style="color: #F92672;">return</span>;

    <span style="color: #A6E22E; font-weight: bold;">__update_curr</span><span style="color: #66D9EF;">(</span>cfs_rq, curr, delta_exec<span style="color: #66D9EF;">)</span>;
    curr-&gt;exec_start = now;

    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E; font-weight: bold;">entity_is_task</span><span style="color: #A6E22E;">(</span>curr<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">task_struct</span> *<span style="color: #FD971F;">curtask</span> = <span style="color: #A6E22E; font-weight: bold;">task_of</span><span style="color: #A6E22E;">(</span>curr<span style="color: #A6E22E;">)</span>;

        <span style="color: #A6E22E; font-weight: bold;">trace_sched_stat_runtime</span><span style="color: #A6E22E;">(</span>curtask, delta_exec, curr-&gt;vruntime<span style="color: #A6E22E;">)</span>;
        <span style="color: #A6E22E; font-weight: bold;">cpuacct_charge</span><span style="color: #A6E22E;">(</span>curtask, delta_exec<span style="color: #A6E22E;">)</span>;
        <span style="color: #A6E22E; font-weight: bold;">account_group_exec_runtime</span><span style="color: #A6E22E;">(</span>curtask, delta_exec<span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>
<span style="color: #AE81FF;">}</span>

<span style="color: #F92672;">static</span> <span style="color: #F92672;">inline</span> <span style="color: #66D9EF;">void</span>
<span style="color: #A6E22E; font-size: 130%;">__update_curr</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cfs_rq</span> *<span style="color: #FD971F;">cfs_rq</span>, <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span> *<span style="color: #FD971F;">curr</span>,
          <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">delta_exec</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">unsigned</span> <span style="color: #66D9EF;">long</span> <span style="color: #FD971F;">delta_exec_weighted</span>;

    <span style="color: #A6E22E; font-weight: bold;">schedstat_set</span><span style="color: #66D9EF;">(</span>curr-&gt;exec_max, <span style="color: #A6E22E; font-weight: bold;">max</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span><span style="color: #66D9EF;">u64</span><span style="color: #E6DB74;">)</span>delta_exec, curr-&gt;exec_max<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>;

    curr-&gt;sum_exec_runtime += delta_exec;
    <span style="color: #A6E22E; font-weight: bold;">schedstat_add</span><span style="color: #66D9EF;">(</span>cfs_rq, exec_clock, delta_exec<span style="color: #66D9EF;">)</span>;
    delta_exec_weighted = <span style="color: #A6E22E; font-weight: bold;">calc_delta_fair</span><span style="color: #66D9EF;">(</span>delta_exec, curr<span style="color: #66D9EF;">)</span>;

    curr-&gt;vruntime += delta_exec_weighted;
    <span style="color: #A6E22E; font-weight: bold;">update_min_vruntime</span><span style="color: #66D9EF;">(</span>cfs_rq<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

</pre>
</div>

<ul class="org-ul">
<li>进程选择<br /></li>
</ul>
<p>
红黑树<br />
enqueue_entity +进程<br />
dequeue_entity -进程<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">static</span> <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span> *<span style="color: #A6E22E; font-size: 130%;">__pick_next_entity</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">cfs_rq</span> *<span style="color: #FD971F;">cfs_rq</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">rb_node</span> *<span style="color: #FD971F;">left</span> = cfs_rq-&gt;rb_leftmost;

    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #E6DB74; font-weight: bold;">!</span>left<span style="color: #66D9EF;">)</span>
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">NULL</span>;

    <span style="color: #F92672;">return</span> <span style="color: #A6E22E; font-weight: bold;">rb_entry</span><span style="color: #66D9EF;">(</span>left, <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">sched_entity</span>, run_node<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>


</pre>
</div>

<ul class="org-ul">
<li>调度器函数 schedule-&gt;pick_next_task，会从高优先级到低优先级调度器类中找第一个进程<br /></li>
<li>休眠<br /></li>
</ul>
<p>
从可执行红黑树中移出，放入等待队列<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #A6E22E; font-size: 130%;">DEFINE_WAIT</span><span style="color: #AE81FF;">(</span>wait<span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#21019;&#24314;&#38431;&#21015;&#39033;</span>
<span style="color: #A6E22E; font-size: 130%;">add_wait_queue</span><span style="color: #AE81FF;">(</span>q, &amp;wait<span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#21152;&#20837;&#31561;&#24453;&#38431;&#21015;</span>
<span style="color: #A6E22E; font-weight: bold;">while</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74; font-weight: bold;">!</span>condition<span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#26465;&#20214;&#19981;&#28385;&#36275;</span>
    <span style="color: #A6E22E; font-weight: bold;">prepare_to_wait</span><span style="color: #66D9EF;">(</span>&amp;q, &amp;wait, TASK_INTERRUPTIBLE<span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#35774;&#32622;&#36827;&#31243;&#29366;&#24577;&#65292;&#22914;&#26524;&#27492;&#26102;&#24050;&#36864;&#20986;&#31561;&#24453;&#38431;&#21015;&#65292;&#37325;&#26032;&#21152;&#20837;</span>
    <span style="color: #A6E22E; font-weight: bold;">if</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E; font-weight: bold;">signal_pending</span><span style="color: #A6E22E;">(</span>current<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span> <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#22788;&#29702;&#20449;&#21495;</span>
    <span style="color: #A6E22E; font-weight: bold;">schedule</span><span style="color: #66D9EF;">()</span>;<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#35843;&#24230;</span>
<span style="color: #AE81FF;">}</span>
<span style="color: #A6E22E; font-weight: bold;">finish_wait</span><span style="color: #AE81FF;">(</span>&amp;q, &amp;wait<span style="color: #AE81FF;">)</span>;<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#32467;&#26463;&#31561;&#24453;</span>
</pre>
</div>
<ul class="org-ul">
<li>唤醒<br /></li>
</ul>
<p>
从等待队列移到红黑树<br />
</p>
<ul class="org-ul">
<li>抢占和上下文切换<br /></li>
</ul>
<p>
switch_mm 切换虚拟内存映射<br />
switch_to 切换寄存器组<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xuali2</p>
<p class="date">Created: 2020-10-12 Mon 12:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
